package ru.fafurin.lesson6;
// Урок 6. Apache Http

public class Main {
// 1. Что такое Apache в контексте протокола HTTP?
    // Ответ: Apache - это веб-сервер, обрабатывающий запросы по протоколу HTTP/HTTPS

// 2. Для чего используется Apache в рамках работы протокола HTTP?
    // Ответ: Веб-сервер Apache — это посредник между серверным компьютером и браузером пользователя.
    // Получив от клиента запрос, он находит нужную страницу в каталоге сайта и отправляет ее в ответ.
    // Браузер анализирует присланный файл и преобразует его в веб-страницу, которую и видит пользователь.

// 3. Существуют ли альтернативы Apache?
    // Ответ: Nginx
}
