package ru.fafurin.lesson1;
// Урок 1. Что? Зачем?

public class Main {

//1. Расскажите, как вы поняли, что такое HTTP?
    // Ответ: HTTP - протокол передачи данных, предназначенный для передачи гипертекстовых документов.
    // Основная задача - обмен данными между пользовательским приложением и сервером.

//2. Какие возможные сценарии использования протокола HTTP?
    // Ответ:
    // Получение пользователем данных с сервера (текст, мультимедия и т.д.).
    // Отправка данных на сервер (регистрация на сайтах, оформление заказа в интернет-магазине).

//3. Опишите методы HTTP
    // Ответ:
//    GET - получение данных
//    POST - отправка данных
//    PUT - обновление данных
//    DELETE - удаление данных

//4. Что такое URL?
    // Ответ:
    // Адрес сайта в Интернете

//5. Какие еще сетевые протоколы вам известны?
    // Ответ:

    // UDP - протокол пользовательских датаграмм, не гарантирующий получение конечным пользователем данных
    // TCP - протокол управления передачей, гарантирующий доставку данных в том порядке, в котором они отправлены.
}