package ru.fafurin.lesson2;
// Урок 2. Заголовки

public class Main {
    // 1. Ознакомьтесь с информацией о заголовках HTTP
    // https://developer.mozilla.org/ru/docs/Web/HTTP/Headers
    // 2. О каких видах заголовках в HTTP вы узнали?
    // Ответ:
    // Allow - список поддерживаемых методов.
    // Accept-Charset - список поддерживаемых кодировок.
    // Content-Language - список языков содержимого.
    // Transfer-Encoding - способы кодирования.
    // Host - домен и порт хоста запрашиваемого ресурса.

    // 3. Расскажите о различиях HTTP и HTTPS?
    // HTTP - это протокол передачи данных,
    // а HTTPS - это расширение HTTP-протокола, объединяющее два криптографических протокола TLS и SSL,
    // следовательно, HTTPS, в отличие от HTTP, позволяет шифровать данные, передающиеся между клиентом и сервером.
}
