package ru.fafurin.lesson4;
// Урок 4. Ответы (responses)

public class Main {
// 1. За что в HTTP отвечают ответы (responses)?
// Ответ: response дает понять, как сервер обработал запрос.
// Для этого существует статус ответа - трехзначный код с текстовым обозначением.

// 2. Назовите диапазон кодов HTTP для информационных сообщений?
// Ответ: 100-199
//
// 3. Назовите диапазон кодов HTTP для перенаправления?
// Ответ: 300-399

// 4. Назовите диапазон кодов HTTP для клиентских ошибок?
// Ответ: 400-499

// 5. Назовите диапазон кодов HTTP для сервисных сообщений?
// Ответ: 500-599
}
