package ru.fafurin.lesson5;
// Урок 5. Serializible, Externalizable

public class Main {
// 1. Что такое сериализация в контексте протокола HTTP?
    // Ответ: в контексте протокола HTTP сериализация используется для передачи данных в текстовом виде,
    // то есть сериализация — это процесс преобразования данных в строку.

// 2. Что такое десериализация в контексте протокола HTTP?
    // Ответ: это обратный сериализации процесс восстановления состояния объекта из сохраненных данных.

// 3. За что отвечает HttpMessageConverter?
    // Ответ: HttpMessageConverter используется для чтения и записи тела HTTP-запросов и ответов через InputStream и OutputStream.
}
